app/views/trips/new.html.haml

SELECT "cars".* FROM "cars"
---
				%li= label_tag(:car_id, "Car Type:")
				%li= select_tag(:car_id, options_for_select(Car.select), prompt: "Select a size")

SELECT "flights".* FROM "flights"
---
			%ul.question
				%li= select_tag(:flight_id, options_for_select(Flight.select), prompt: "Origin of Flight")