app/views/events/index.html.haml

SELECT "events"."name" FROM "events"
---
      = form_tag events_path, method: 'get' do
        = collection_select(:event, :name, Event.all, :id, :name, {:prompt => "Select an Event", :multiple => true }, {:class => "dropdown"})