app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE (name iLIKE '%k%')  ORDER BY "events"."id" DESC LIMIT 10
SELECT "events".* FROM "events"
---
  def index
    # @events = Event.all
    if params[:event_search].present?
      q = "%#{params[:event_search]}%"
      @events = Event.where("name iLIKE ?", q).last(10)
      @events_all = Event.all

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "trips"  WHERE "trips"."event_id" = $1  [["event_id", 1]]
SELECT COUNT(*) FROM "pledges"  WHERE "pledges"."event_id" = $1  [["event_id", 1]]
---
  def show
    @event = Event.find(params[:id])
    @total_trips = @event.trips.count
    @total_carbon = @event.total(:carbon)
    @total_km = @event.total(:km_travelled)
    # @total_trees = @event.total_trees
    @total_pledge = @event.pledges.count