app/controllers/pledges_controller.rb

INSERT INTO "pledges" ("about", "created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["about", "By August..."], ["created_at", "2015-07-16 07:58:53.975230"], ["event_id", 1], ["updated_at", "2015-07-16 07:58:53.975230"], ["user_id", 2]]
---
  def create
  	@pledge = Pledge.create(pledge_params.merge({user_id: session[:user_id], event_id: @event.id}))

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_event
    @event = Event.find(params[:event_id])