app/controllers/trees_controller.rb

INSERT INTO "trees" ("created_at", "event_id", "rand_given", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-07-16 07:41:09.221767"], ["event_id", 1], ["rand_given", 200], ["updated_at", "2015-07-16 07:41:09.221767"], ["user_id", 1]]
---
  def create
    @tree = Tree.create(tree_params.merge({user_id: session[:user_id], event_id: @event.id}))

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_event
    @event = Event.find(params[:event_id])