app/controllers/users_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
      @event = Event.find(params[:event_id])

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'l@l.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "surname", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-07-20 13:52:56.415418"], ["email", "w@m.co"], ["name", "Well"], ["surname", "Maybe"], ["updated_at", "2015-07-20 13:52:56.415418"]]
---
  def create
    @user = User.find_by(email: user_params[:email])
    unless @user
      @user = User.create(user_params)